IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/I2C1_CFG.xml
<module name="I2C1_CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CFG_I2C_REVNB_LO" acronym="CFG_I2C_REVNB_LO" offset="0x0" width="32" description="Revision Number register (Low)">
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x1" description="RTL version This field changes on bug fix, and resets to" range="15 - 11" rwaccess="R"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x0" description="Major Revision This field changes when there is a major feature change This field does not change due to bug fix, or minor feature change" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Indicates a special version for a particular device Consequence of use may avoid use of standard Chip Support Library [CSL] / Drivers 0 if non-custom" range="7 - 6" rwaccess="R"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x12" description="Minor Revision This field changes when features are scaled up or down This field does not change due to bug fix, or major feature change" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_I2C_REVNB_HI" acronym="CFG_I2C_REVNB_HI" offset="0x4" width="32" description="Revision Number register (High)">
		<bitfield id="SCHEME" width="2" begin="15" end="14" resetval="0x1" description="Used to distinguish between old Scheme and current Spare bit to encode future schemes" range="15 - 14" rwaccess="R"/> 
		<bitfield id="RESERVED" width="2" begin="13" end="12" resetval="0x1" description="Reads return 0x1" range="13 - 12" rwaccess="R"/> 
		<bitfield id="FUNC" width="12" begin="11" end="0" resetval="0x64" description="Function: Indicates a software compatible module family" range="11 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_I2C_SYSC" acronym="CFG_I2C_SYSC" offset="0x10" width="32" description="System Configuration register">
		<bitfield id="CLKACTIVITY" width="2" begin="9" end="8" resetval="0x0" description="Clock Activity selection bits" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="RESERVED" width="3" begin="7" end="5" resetval="0x0" description="Reads return 0" range="7 - 5" rwaccess="N/A"/> 
		<bitfield id="IDLEMODE" width="2" begin="4" end="3" resetval="0x0" description="Idle Mode selection bits" range="4 - 3" rwaccess="R/W"/> 
		<bitfield id="ENAWAKEUP" width="1" begin="2" end="2" resetval="0x0" description="Enable Wakeup control bit" range="2" rwaccess="R/W"/> 
		<bitfield id="SRST" width="1" begin="1" end="1" resetval="0x0" description="SoftReset bit" range="1" rwaccess="R/W"/> 
		<bitfield id="AUTOIDLE" width="1" begin="0" end="0" resetval="0x1" description="Autoidle bit" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_EOI" acronym="CFG_I2C_EOI" offset="0x20" width="32" description="End Of Interrupt number specification">
		<bitfield id="LINE_NUMBER" width="1" begin="0" end="0" resetval="0x0" description="Software End Of Interrupt [EOI] control Write number of interrupt output" range="0" rwaccess="W"/>
	</register>
	<register id="CFG_I2C_IRQSTATUS_RAW" acronym="CFG_I2C_IRQSTATUS_RAW" offset="0x24" width="32" description="Per-event raw interrupt status vector">
		<bitfield id="RESERVED" width="1" begin="15" end="15" resetval="0x0" description="Write 0s for future compatibility Read returns 0" range="15" rwaccess="N/A"/> 
		<bitfield id="XDR" width="1" begin="14" end="14" resetval="0x0" description="Transmit draining IRQ status" range="14" rwaccess="R/W"/> 
		<bitfield id="RDR" width="1" begin="13" end="13" resetval="0x0" description="Receive draining IRQ status" range="13" rwaccess="R/W"/> 
		<bitfield id="BB" width="1" begin="12" end="12" resetval="0x0" description="Bus busy statusWriting into this bit has no effect" range="12" rwaccess="R"/> 
		<bitfield id="ROVR" width="1" begin="11" end="11" resetval="0x0" description="Receive overrun statusWriting into this bit has no effect" range="11" rwaccess="R/W"/> 
		<bitfield id="XUDF" width="1" begin="10" end="10" resetval="0x0" description="Transmit underflow statusWriting into this bit has no effect" range="10" rwaccess="R/W"/> 
		<bitfield id="AAS" width="1" begin="9" end="9" resetval="0x0" description="Address recognized as slave IRQ status" range="9" rwaccess="R/W"/> 
		<bitfield id="BF" width="1" begin="8" end="8" resetval="0x0" description="Bus Free IRQ status" range="8" rwaccess="R/W"/> 
		<bitfield id="AERR" width="1" begin="7" end="7" resetval="0x0" description="Access Error IRQ status" range="7" rwaccess="R/W"/> 
		<bitfield id="STC" width="1" begin="6" end="6" resetval="0x0" description="Start Condition IRQ status" range="6" rwaccess="R/W"/> 
		<bitfield id="GC" width="1" begin="5" end="5" resetval="0x0" description="General call IRQ status Set to '1' by core when General call address detected and interrupt signaled to MPUSS Write '1' to clear" range="5" rwaccess="R/W1C"/> 
		<bitfield id="XRDY" width="1" begin="4" end="4" resetval="0x0" description="Transmit data ready IRQ status Set to '1' by core when transmitter and when new data is requested When set to '1' by core, an interrupt is signaled to MPUSS Write '1' to clear" range="4" rwaccess="R/W1C"/> 
		<bitfield id="RRDY" width="1" begin="3" end="3" resetval="0x0" description="Receive data ready IRQ status Set to '1' by core when receiver mode, a new data is able to be read When set to '1' by core, an interrupt is signaled to MPUSS Write '1' to clear" range="3" rwaccess="R/W1C"/> 
		<bitfield id="ARDY" width="1" begin="2" end="2" resetval="0x0" description="Register access ready IRQ status When set to '1' it indicates that previous access has been performed and registers are ready to be accessed again An interrupt is signaled to MPUSS Write '1' to clear" range="2" rwaccess="R/W1C"/> 
		<bitfield id="NACK" width="1" begin="1" end="1" resetval="0x0" description="No acknowledgement IRQ status Bit is set when No Acknowledge has been received, an interrupt is signaled to MPUSS Write '1' to clear this bit" range="1" rwaccess="R/W1C"/> 
		<bitfield id="AL" width="1" begin="0" end="0" resetval="0x0" description="Arbitration lost IRQ status This bit is automatically set by the hardware when it loses the Arbitration in master transmit mode, an interrupt is signaled to MPUSS During reads, it always returns 0" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_IRQSTATUS" acronym="CFG_I2C_IRQSTATUS" offset="0x28" width="32" description="Per-event enabled interrupt status vector">
		<bitfield id="RESERVED" width="1" begin="15" end="15" resetval="0x0" description="Write 0s for future compatibility Read returns 0" range="15" rwaccess="N/A"/> 
		<bitfield id="XDR" width="1" begin="14" end="14" resetval="0x0" description="Transmit draining IRQ enabled status" range="14" rwaccess="R/W"/> 
		<bitfield id="RDR" width="1" begin="13" end="13" resetval="0x0" description="Receive draining IRQ enabled status" range="13" rwaccess="R/W"/> 
		<bitfield id="BB" width="1" begin="12" end="12" resetval="0x0" description="Bus busy enabled statusWriting into this bit has no effect" range="12" rwaccess="R"/> 
		<bitfield id="ROVR" width="1" begin="11" end="11" resetval="0x0" description="Receive overrun enabled statusWriting into this bit has no effect" range="11" rwaccess="R/W"/> 
		<bitfield id="XUDF" width="1" begin="10" end="10" resetval="0x0" description="Transmit underflow enabled statusWriting into this bit has no effect" range="10" rwaccess="R/W"/> 
		<bitfield id="AAS" width="1" begin="9" end="9" resetval="0x0" description="Address recognized as slave IRQ enabled status" range="9" rwaccess="R/W"/> 
		<bitfield id="BF" width="1" begin="8" end="8" resetval="0x0" description="Bus Free IRQ enabled status" range="8" rwaccess="R/W"/> 
		<bitfield id="AERR" width="1" begin="7" end="7" resetval="0x0" description="Access Error IRQ enabled status" range="7" rwaccess="R/W"/> 
		<bitfield id="STC" width="1" begin="6" end="6" resetval="0x0" description="Start Condition IRQ enabled status" range="6" rwaccess="R/W"/> 
		<bitfield id="GC" width="1" begin="5" end="5" resetval="0x0" description="General call IRQ enabled status Set to '1' by core when General call address detected and interrupt signaled to MPUSS Write '1' to clear" range="5" rwaccess="R/W"/> 
		<bitfield id="XRDY" width="1" begin="4" end="4" resetval="0x0" description="Transmit data ready IRQ enabled status Set to '1' by core when transmitter and when new data is requested When set to '1' by core, an interrupt is signaled to MPUSS Write '1' to clear" range="4" rwaccess="R/W"/> 
		<bitfield id="RRDY" width="1" begin="3" end="3" resetval="0x0" description="Receive data ready IRQ enabled status Set to '1' by core when receiver mode, a new data is able to be read When set to '1' by core, an interrupt is signaled to MPUSS Write '1' to clear" range="3" rwaccess="R/W"/> 
		<bitfield id="ARDY" width="1" begin="2" end="2" resetval="0x0" description="Register access ready IRQ enabled status When set to '1' it indicates that previous access has been performed and registers are ready to be accessed again An interrupt is signaled to MPUSS Write '1' to clear" range="2" rwaccess="R/W"/> 
		<bitfield id="NACK" width="1" begin="1" end="1" resetval="0x0" description="No acknowledgement IRQ enabled status Bit is set when No Acknowledge has been received, an interrupt is signaled to MPUSS Write '1' to clear this bit" range="1" rwaccess="R/W"/> 
		<bitfield id="AL" width="1" begin="0" end="0" resetval="0x0" description="Arbitration lost IRQ enabled status This bit is automatically set by the hardware when it loses the Arbitration in master transmit mode, an interrupt is signaled to MPUSS During reads, it always returns 0" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_IRQENABLE_SET" acronym="CFG_I2C_IRQENABLE_SET" offset="0x2C" width="32" description="Per-event interrupt enable bit vector.">
		<bitfield id="RESERVED" width="1" begin="15" end="15" resetval="0x0" description="Write 0s for future compatibility Read returns 0" range="15" rwaccess="N/A"/> 
		<bitfield id="XDR_IE" width="1" begin="14" end="14" resetval="0x0" description="Transmit Draining interrupt enable set Mask or unmask the interrupt signaled by bit in I2C_STAT[XDR]" range="14" rwaccess="R/W"/> 
		<bitfield id="RDR_IE" width="1" begin="13" end="13" resetval="0x0" description="Receive Draining interrupt enable set Mask or unmask the interrupt signaled by bit in I2C_STAT[RDR]" range="13" rwaccess="R/W"/> 
		<bitfield id="ROVR" width="1" begin="11" end="11" resetval="0x0" description="Receive overrun enable set" range="11" rwaccess="R/W"/> 
		<bitfield id="XUDF" width="1" begin="10" end="10" resetval="0x0" description="Transmit underflow enable set" range="10" rwaccess="R/W"/> 
		<bitfield id="ASS_IE" width="1" begin="9" end="9" resetval="0x0" description="Addressed as Slave interrupt enable set Mask or unmask the interrupt signaled by bit in I2C_STAT[AAS]" range="9" rwaccess="R/W"/> 
		<bitfield id="BF_IE" width="1" begin="8" end="8" resetval="0x0" description="Bus Free interrupt enable set Mask or unmask the interrupt signaled by bit in I2C_STAT[BF]" range="8" rwaccess="R/W"/> 
		<bitfield id="AERR_IE" width="1" begin="7" end="7" resetval="0x0" description="Access Error interrupt enable set Mask or unmask the interrupt signaled by bit in I2C_STAT[AERR]" range="7" rwaccess="R/W"/> 
		<bitfield id="STC_IE" width="1" begin="6" end="6" resetval="0x0" description="Start Condition interrupt enable set Mask or unmask the interrupt signaled by bit in I2C_STAT[STC]" range="6" rwaccess="R/W"/> 
		<bitfield id="GC_IE" width="1" begin="5" end="5" resetval="0x0" description="General call Interrupt enable set Mask or unmask the interrupt signaled by bit in I2C_STAT[GC]" range="5" rwaccess="R/W"/> 
		<bitfield id="XRDY_IE" width="1" begin="4" end="4" resetval="0x0" description="Transmit data ready interrupt enable set Mask or unmask the interrupt signaled by bit in I2C_STAT[XRDY]" range="4" rwaccess="R/W"/> 
		<bitfield id="RRDY_IE" width="1" begin="3" end="3" resetval="0x0" description="Receive data ready interrupt enable set Mask or unmask the interrupt signaled by bit in I2C_STAT[RRDY]" range="3" rwaccess="R/W"/> 
		<bitfield id="ARDY_IE" width="1" begin="2" end="2" resetval="0x0" description="Register access ready interrupt enable set Mask or unmask the interrupt signaled by bit in I2C_STAT[ARDY]" range="2" rwaccess="R/W"/> 
		<bitfield id="NACK_IE" width="1" begin="1" end="1" resetval="0x0" description="No acknowledgement interrupt enable set Mask or unmask the interrupt signaled by bit in I2C_STAT[NACK]" range="1" rwaccess="R/W"/> 
		<bitfield id="AL_IE" width="1" begin="0" end="0" resetval="0x0" description="Arbitration lost interrupt enable set Mask or unmask the interrupt signaled by bit in I2C_STAT[AL]" range="0" rwaccess="R/W"/>
	</register>
