IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/I2C1_CFG.xml
	<register id="CFG_I2C_SYSS" acronym="CFG_I2C_SYSS" offset="0x90" width="32" description="System Status register">
		<bitfield id="RDONE" width="1" begin="0" end="0" resetval="0x0" description="Reset done bit" range="0" rwaccess="R"/>
	</register>
	<register id="CFG_I2C_BUF" acronym="CFG_I2C_BUF" offset="0x94" width="32" description="Buffer Configuration register">
		<bitfield id="RDMA_EN" width="1" begin="15" end="15" resetval="0x0" description="Receive DMA channel enable" range="15" rwaccess="R/W"/> 
		<bitfield id="RXFIFO_CLR" width="1" begin="14" end="14" resetval="0x0" description="Receive FIFO clear" range="14" rwaccess="R/W"/> 
		<bitfield id="RXTRSH" width="6" begin="13" end="8" resetval="0x0" description="Threshold value for FIFO buffer in RX mode" range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="XDMA_EN" width="1" begin="7" end="7" resetval="0x0" description="Transmit DMA channel enable" range="7" rwaccess="R/W"/> 
		<bitfield id="TXFIFO_CLR" width="1" begin="6" end="6" resetval="0x0" description="Transmit FIFO clear" range="6" rwaccess="R/W"/> 
		<bitfield id="TXTRSH" width="6" begin="5" end="0" resetval="0x0" description="Threshold value for FIFO buffer in TX mode" range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_CNT" acronym="CFG_I2C_CNT" offset="0x98" width="32" description="Data counter register">
		<bitfield id="DCOUNT" width="16" begin="15" end="0" resetval="0x0" description="Data count" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_DATA" acronym="CFG_I2C_DATA" offset="0x9C" width="32" description="Data access register">
		<bitfield id="DATA" width="8" begin="7" end="0" resetval="0x0" description="Transmit/Receive data FIFO endpoint" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_CON" acronym="CFG_I2C_CON" offset="0xA4" width="32" description="I2C configuration register.">
		<bitfield id="I2C_EN" width="1" begin="15" end="15" resetval="0x0" description="I2C module enable" range="15" rwaccess="R/W"/> 
		<bitfield id="OPMODE" width="2" begin="13" end="12" resetval="0x0" description="Operation mode selection" range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="STB" width="1" begin="11" end="11" resetval="0x0" description="Start byte mode [master mode only]" range="11" rwaccess="R/W"/> 
		<bitfield id="MST" width="1" begin="10" end="10" resetval="0x0" description="Master/slave mode" range="10" rwaccess="R/W"/> 
		<bitfield id="TRX" width="1" begin="9" end="9" resetval="0x0" description="Transmitter/Receiver mode [master mode only]" range="9" rwaccess="R/W"/> 
		<bitfield id="XSA" width="1" begin="8" end="8" resetval="0x0" description="Expand Slave address" range="8" rwaccess="R/W"/> 
		<bitfield id="XOA0" width="1" begin="7" end="7" resetval="0x0" description="Expand Own address 0" range="7" rwaccess="R/W"/> 
		<bitfield id="XOA1" width="1" begin="6" end="6" resetval="0x0" description="Expand Own address 1" range="6" rwaccess="R/W"/> 
		<bitfield id="XOA2" width="1" begin="5" end="5" resetval="0x0" description="Expand Own address 2" range="5" rwaccess="R/W"/> 
		<bitfield id="XOA3" width="1" begin="4" end="4" resetval="0x0" description="Expand Own address 3" range="4" rwaccess="R/W"/> 
		<bitfield id="STP" width="1" begin="1" end="1" resetval="0x0" description="Stop condition [master mode only]" range="1" rwaccess="R/W"/> 
		<bitfield id="STT" width="1" begin="0" end="0" resetval="0x0" description="Start condition [master mode only]" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_OA" acronym="CFG_I2C_OA" offset="0xA8" width="32" description="Own address register">
		<bitfield id="MCODE" width="3" begin="15" end="13" resetval="0x0" description="Master Code" range="15 - 13" rwaccess="R/W"/> 
		<bitfield id="OA" width="10" begin="9" end="0" resetval="0x0" description="Own address" range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_SA" acronym="CFG_I2C_SA" offset="0xAC" width="32" description="Slave address register">
		<bitfield id="SA" width="10" begin="9" end="0" resetval="0x1023" description="Slave address" range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_PSC" acronym="CFG_I2C_PSC" offset="0xB0" width="32" description="I2C Clock Prescaler Register">
		<bitfield id="PSC" width="8" begin="7" end="0" resetval="0x0" description="Fast/Standard mode prescale sampling clock divider value 0x0: Divide by 1 0x1: Divide by 2  0xFF: Divide by 256" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_SCLL" acronym="CFG_I2C_SCLL" offset="0xB4" width="32" description="I2C SCL Low Time Register.">
		<bitfield id="HSSCLL" width="8" begin="15" end="8" resetval="0x0" description="High Speed mode SCL low time" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="SCLL" width="8" begin="7" end="0" resetval="0x0" description="Fast/Standard mode SCL low time" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_SCLH" acronym="CFG_I2C_SCLH" offset="0xB8" width="32" description="I2C SCL High Time Register.">
		<bitfield id="HSSCLH" width="8" begin="15" end="8" resetval="0x0" description="High Speed mode SCL high time" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="SCLH" width="8" begin="7" end="0" resetval="0x0" description="Fast/Standard mode SCL high time" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_SYSTEST" acronym="CFG_I2C_SYSTEST" offset="0xBC" width="32" description="I2C System Test Register.">
		<bitfield id="ST_EN" width="1" begin="15" end="15" resetval="0x0" description="System test enable" range="15" rwaccess="R/W"/> 
		<bitfield id="FREE" width="1" begin="14" end="14" resetval="0x0" description="Free running mode [on breakpoint]" range="14" rwaccess="R/W"/> 
		<bitfield id="TMODE" width="2" begin="13" end="12" resetval="0x0" description="Test mode select" range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="SSB" width="1" begin="11" end="11" resetval="0x0" description="Set status bits" range="11" rwaccess="R/W"/> 
		<bitfield id="SCL_I_FUNC" width="1" begin="8" end="8" resetval="0x1" description="SCL line input value [functional mode]" range="8" rwaccess="R"/> 
		<bitfield id="SCL_O_FUNC" width="1" begin="7" end="7" resetval="0x1" description="SCL line output value [functional mode]" range="7" rwaccess="R"/> 
		<bitfield id="SDA_I_FUNC" width="1" begin="6" end="6" resetval="0x1" description="SDA line input value [functional mode]" range="6" rwaccess="R"/> 
		<bitfield id="SDA_O_FUNC" width="1" begin="5" end="5" resetval="0x1" description="SDA line output value [functional mode]" range="5" rwaccess="R"/> 
		<bitfield id="SCCB_E_O" width="1" begin="4" end="4" resetval="0x0" description="SCCB_E line sense output value" range="4" rwaccess="R/W"/> 
		<bitfield id="SCL_I" width="1" begin="3" end="3" resetval="0x0" description="SCL line sense input value" range="3" rwaccess="R"/> 
		<bitfield id="SCL_O" width="1" begin="2" end="2" resetval="0x0" description="SCL line drive output value" range="2" rwaccess="R/W"/> 
		<bitfield id="SDA_I" width="1" begin="1" end="1" resetval="0x0" description="SDA line sense input value" range="1" rwaccess="R"/> 
		<bitfield id="SDA_O" width="1" begin="0" end="0" resetval="0x0" description="SDA line drive output value" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_BUFSTAT" acronym="CFG_I2C_BUFSTAT" offset="0xC0" width="32" description="I2C Buffer Status Register.">
		<bitfield id="FIFODEPTH" width="2" begin="15" end="14" resetval="0x2" description="Internal FIFO buffers depth" range="15 - 14" rwaccess="R"/> 
		<bitfield id="RXSTAT" width="6" begin="13" end="8" resetval="0x0" description="RX Buffer Status" range="13 - 8" rwaccess="R"/> 
		<bitfield id="TXSTAT" width="6" begin="5" end="0" resetval="0x0" description="TX Buffer Status" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_I2C_OA1" acronym="CFG_I2C_OA1" offset="0xC4" width="32" description="I2C Own Address 1 Register">
		<bitfield id="OA1" width="10" begin="9" end="0" resetval="0x0" description="Own address 1" range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_OA2" acronym="CFG_I2C_OA2" offset="0xC8" width="32" description="I2C Own Address 2
 Register">
		<bitfield id="OA2" width="10" begin="9" end="0" resetval="0x0" description="Own address 2" range="9 - 0" rwaccess="R/W"/>
	</register>
